# Data Science Pandas

## Tasks Today:

0) <b>Pre-Work</b> <br>
 &nbsp;&nbsp;&nbsp;&nbsp; a) Numpy Random Sampling

1) <b>Pandas</b> <br>
 &nbsp;&nbsp;&nbsp;&nbsp; a) Importing <br>
 &nbsp;&nbsp;&nbsp;&nbsp; b) Tabular Data Structures <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - from_dict() <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - read_csv() <br>
 &nbsp;&nbsp;&nbsp;&nbsp; c) <b>In-Class Exercise #1</b> <br>
 &nbsp;&nbsp;&nbsp;&nbsp; d) Accessing Data <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - Indexing <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - df.loc <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - keys() <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - Slicing a DataFrame <br>
 &nbsp;&nbsp;&nbsp;&nbsp; e) Built-In Methods <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - head() <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - tail() <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - shape <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - describe() <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - sort_values() <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - .columns <br>
 &nbsp;&nbsp;&nbsp;&nbsp; f) <b>In-Class Exercise #2</b> <br>
 &nbsp;&nbsp;&nbsp;&nbsp; g) Filtration <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - Conditionals <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - Subsetting <br>
 &nbsp;&nbsp;&nbsp;&nbsp; h) Column Transformations <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - Generating a New Column w/Data <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - User Defined Function <br>
 &nbsp;&nbsp;&nbsp;&nbsp; i) Aggregations <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - groupby() <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - Type of groupby() <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - mean() <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - groupby() w/Multiple Columns <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - drop_duplicates() <br>

## Numpy Random Sampling

In [68]:
import numpy as np

# A single call generates a single random number
print('Here is a random number: %s' % np.random.uniform())

# You can also pass some bounds
print('Here is a random number between 0 and 1 Million: %s' % np.random.uniform(0, 1e6))

# You can also generate a bunch of random numbers all at once
print('Here are 3 random numbers between 0 and 1 Million: %s' % np.random.uniform(0, 1e6, 3))

# Even matrices and tensors with weird shapes
print('Here is a 3x3 matrix of random numbers between 0 and 1 Million: \n %s' % np.random.uniform(0, 1e6, (3, 3)))

# instead of float values, generating random integers
print('Using Random Integer: %s' % np.random.randint(0, 10, 4))

Here is a random number: 0.6239729009157174
Here is a random number between 0 and 1 Million: 966358.7208945974
Here are 3 random numbers between 0 and 1 Million: [759646.74871556 497486.78212441 927192.57937231]
Here is a 3x3 matrix of random numbers between 0 and 1 Million:
 [[778039.87772288 733330.14086422 660309.53853416]
 [713876.75664573 178845.23576777 211638.69992379]
 [352883.75723472 783205.12555355 946941.70747333]]
Using Random Integer: [3 0 9 7]

## Pandas <br>

<p>Pandas is a flexible data analysis library built on top of NumPy that is excellent for working with tabular data. It is currently the de-facto standard for Python-based data analysis, and fluency in Pandas will do wonders for your productivity and frankly your resume. It is one of the fastest ways of getting from zero to answer in existence. </p>

<ul>
    <li>Pandas is a Python module, written in C. The Pandas module is a high performance, highly efficient, and high level data analysis library. It allows us to work with large sets of data called dataframes.</li>
    <li>Series is a one-dimensional labeled array capable of holding data of any type (integer, string, float, python objects, etc.)</li>
    <li>Dataframe = Spreadsheet (has column headers, index, etc.)</li>
</ul>

### Importing

In [69]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\jae prince\anaconda3\lib\site-packages (1.0.5)
Requirement already satisfied: numpy>=1.13.3 in c:\users\jae prince\anaconda3\lib\site-packages (from pandas) (1.18.5)
Requirement already satisfied: python-dateutil>=2.6.1 in c:\users\jae prince\anaconda3\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: pytz>=2017.2 in c:\users\jae prince\anaconda3\lib\site-packages (from pandas) (2020.1)
Requirement already satisfied: six>=1.5 in c:\users\jae prince\anaconda3\lib\site-packages (from python-dateutil>=2.6.1->pandas) (1.15.0)

In [70]:
import pandas as pd

# always use pd, standard for data science

### Tabular data structures <br>
<p>The central object of study in Pandas is the DataFrame, which is a tabular data structure with rows and columns like an excel spreadsheet. The first point of discussion is the creation of dataframes both from native Python dictionaries, and text files through the Pandas I/O system.</p>

In [96]:
names = ['Alice',
         'Bob',
         'James',
         'Beth', 
         'John', 
         'Sally',
         'Richard', 
         'Lauren',
         'Brandon', 
         'Sabrina']

#generates random ages for the data above and has the length of our list
ages = np.random.randint(18,35,len(names))

my_people = {
    'names': names,
    'ages': ages
}

my_people

{'names': ['Alice',
  'Bob',
  'James',
  'Beth',
  'John',
  'Sally',
  'Richard',
  'Lauren',
  'Brandon',
  'Sabrina'],
 'ages': array([28, 31, 32, 29, 33, 31, 32, 28, 32, 19])}

##### from_dict()

<p>Let's convert our not-so-useful-for-analysis dict into a Pandas dataframe. We can use the from_dict function to do this easily using Pandas:</p>

In [72]:
data = pd.DataFrame.from_dict(my_people)

data

     names  ages
0    Alice    31
1      Bob    24
2    James    25
3     Beth    31
4     John    29
5    Sally    29
6  Richard    33
7   Lauren    33
8  Brandon    20
9  Sabrina    21

##### read_csv()

In [73]:
marathon = pd.read_csv('files/boston_marathon2017_edited.csv', sep = ',')

## gives you all the columns: 
pd.set_option('display.max_columns',None)

## gives you all the rows : pd.set_option('display.max_rows' NONE)

marathon

,10K,15K,20K,25K,30K,35K,40K,5K,Age,Bib,Overall Time in Seconds,Citizenship,Male Average Times,Females Average Times,City,Country,Division,Gender,Half,M/F,Name,Number of Records,Official Time,Overall,Pace,State
0,12/30/1899 12:30:28 AM,12/30/1899 12:45:44 AM,12/30/1899 1:01:15 AM,12/30/1899 1:16:59 AM,12/30/1899 1:33:01 AM,12/30/1899 1:48:19 AM,12/30/1899 2:02:53 AM,12/30/1899 12:15:25 AM,24,11.0,7777,KEN,7777.0,NaN,Keringet,KEN,1,1,12/30/1899 1:04:35 AM,M,"Kirui, Geoffrey",1,12/30/1899 2:09:37 AM,1,12/30/1899 12:04:57 AM,NaN
1,12/30/1899 12:30:27 AM,12/30/1899 12:45:44 AM,12/30/1899 1:01:15 AM,12/30/1899 1:16:59 AM,12/30/1899 1:33:01 AM,12/30/1899 1:48:19 AM,12/30/1899 2:03:14 AM,12/30/1899 12:15:24 AM,30,17.0,7798,USA,7798.0,NaN,Portland,USA,2,2,12/30/1899 1:04:35 AM,M,"Rupp, Galen",1,12/30/1899 2:09:58 AM,2,12/30/1899 12:04:58 AM,OR
2,12/30/1899 12:30:29 AM,12/30/1899 12:45:44 AM,12/30/1899 1:01:16 AM,12/30/1899 1:17:00 AM,12/30/1899 1:33:01 AM,12/30/1899 1:48:31 AM,12/30/1899 2:03:38 AM,12/30/1899 12:15:25 AM,25,23.0,7828,JPN,7828.0,NaN,Machida-City,JPN,3,3,12/30/1899 1:04:36 AM,M,"Osako, Suguru",1,12/30/1899 2:10:28 AM,3,12/30/1899 12:04:59 AM,NaN
3,12/30/1899 12:30:29 AM,12/30/1899 12:45:44 AM,12/30/1899 1:01:19 AM,12/30/1899 1:17:00 AM,12/30/1899 1:33:01 AM,12/30/1899 1:48:58 AM,12/30/1899 2:04:35 AM,12/30/1899 12:15:25 AM,32,21.0,7928,USA,7928.0,NaN,Mammoth Lakes,USA,4,4,12/30/1899 1:04:45 AM,M,"Biwott, Shadrack",1,12/30/1899 2:12:08 AM,4,12/30/1899 12:05:03 AM,CA
4,12/30/1899 12:30:28 AM,12/30/1899 12:45:44 AM,12/30/1899 1:01:15 AM,12/30/1899 1:16:59 AM,12/30/1899 1:33:01 AM,12/30/1899 1:48:41 AM,12/30/1899 2:05:00 AM,12/30/1899 12:15:25 AM,31,9.0,7955,KEN,7955.0,NaN,Marakwet,KEN,5,5,12/30/1899 1:04:35 AM,M,"Chebet, Wilson",1,12/30/1899 2:12:35 AM,5,12/30/1899 12:05:04 AM,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
26405,12/30/1899 1:35:41 AM,12/30/1899 2:23:35 AM,12/30/1899 3:12:44 AM,12/30/1899 4:12:06 AM,12/30/1899 5:03:08 AM,12/30/1899 5:55:18 AM,12/30/1899 6:46:57 AM,12/30/1899 12:46:44 AM,61,25166.0,25779,USA,NaN,25779.0,Ontario,USA,344,11972,12/30/1899 3:23:31 AM,F,"Steinbach, Paula Eyvonne",1,12/30/1899 7:09:39 AM,26407,12/30/1899 12:16:24 AM,CA
26406,12/30/1899 1:05:33 AM,12/30/1899 1:52:17 AM,12/30/1899 2:49:41 AM,12/30/1899 3:50:19 AM,12/30/1899 4:50:01 AM,12/30/1899 5:53:48 AM,12/30/1899 6:54:21 AM,12/30/1899 12:32:03 AM,25,25178.0,26219,USA,26219.0,NaN,Fayetteville,USA,4774,14436,12/30/1899 3:00:26 AM,M,"Avelino, Andrew R.",1,12/30/1899 7:16:59 AM,26408,12/30/1899 12:16:40 AM,NC
26407,12/30/1899 1:43:36 AM,12/30/1899 2:32:36 AM,NaN,12/30/1899 4:15:21 AM,12/30/1899 5:06:37 AM,12/30/1899 6:00:33 AM,12/30/1899 6:54:38 AM,12/30/1899 12:53:11 AM,57,27086.0,26377,USA,NaN,26377.0,Malvern,USA,698,11973,12/30/1899 3:36:24 AM,F,"Hantel, Johanna",1,12/30/1899 7:19:37 AM,26409,12/30/1899 12:16:47 AM,PA
26408,12/30/1899 1:27:19 AM,12/30/1899 2:17:17 AM,12/30/1899 3:11:40 AM,12/30/1899 4:06:10 AM,12/30/1899 5:07:09 AM,12/30/1899 6:06:07 AM,12/30/1899 6:56:08 AM,12/30/1899 12:40:34 AM,64,25268.0,26444,USA,26444.0,NaN,New York,USA,1043,14437,12/30/1899 3:22:30 AM,M,"Reilly, Bill",1,12/30/1899 7:20:44 AM,26410,12/30/1899 12:16:49 AM,NY
26409,12/30/1899 1:17:12 AM,12/30/1899 2:00:10 AM,12/30/1899 2:58:55 AM,12/30/1899 4:27:14 AM,12/30/1899 5:37:13 AM,12/30/1899 6:39:07 AM,12/30/1899 7:41:23 AM,12/30/1899 12:39:36 AM,48,25266.0,28694,USA,28694.0,NaN,Alpharetta,USA,2553,14438,12/30/1899 3:08:16 AM,M,"Rigsby, Scott",1,12/30/1899 7:58:14 AM,26411,12/30/1899 12:18:15 AM,GA

### In-Class Exercise #1 - Read in Boston Red Sox Hitting Data <br>
<p>Use the pandas read_csv() method to read in the statistics from the two files yesterday.</p>

In [74]:
# marathon = pd.read_csv('files/boston_marathon2017_edited.csv', sep = ',')

# ## gives you all the columns: 
# pd.set_option('display.max_columns',None)

# ## gives you all the rows : pd.set_option('display.max_rows' NONE)

# marathon


baseballStats = pd.read_csv('files/redsox_2017_hitting.txt', sep = ',')
baseballStats2 = pd.read_csv('files/redsox_2018_hitting.txt', sep = ',')

### Accessing Data <br>

##### Indexing

<p>You can directly select a column of a dataframe just like you would a dict. The result is a Pandas 'Series' object.</p>

In [75]:
data_ages = data['ages']

#print out the type of the variable data 
print(type(data_ages)) #Series
print(type(data)) #DataFrame

print(float(data_ages[0]))
print(data_ages)

<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>
31.0
0    31
1    24
2    25
3    31
4    29
5    29
6    33
7    33
8    20
9    21
Name: ages, dtype: int32

##### df.loc

<p>Along the horizontal dimension, rows of Pandas DataFrames are Row objects. You will notice there is a third column present in the DataFrame - this is the $\textit{index}$. It is automatically generated as a row number, but can be reassigned to a column of your choice using the DataFrame.set_index(colname) method. We can use it to access particular Pandas $\textit{rows}$, which are also Series objects:</p>

In [76]:
print (data)

#Grab the first row of data --- bt the index of the row

my_first_row = data.loc[0]

print(f'\n Location of the first row in data: {my_first_row}')

# Reset our my_people dataframe index
reset_index = data.set_index('names')

reset_index.loc['James']

     names  ages
0    Alice    31
1      Bob    24
2    James    25
3     Beth    31
4     John    29
5    Sally    29
6  Richard    33
7   Lauren    33
8  Brandon    20
9  Sabrina    21

 Location of the first row in data: names    Alice
ages        31
Name: 0, dtype: object

ages    25
Name: James, dtype: int32

##### keys()

In [77]:
# Find what kind of columns are in this data file
#Access all od the keys/columns of the dataframe
#dataframke.keys()
data.keys()

marathon.keys()

Index(['10K', '15K', '20K', '25K', '30K', '35K', '40K', '5K', 'Age', 'Bib',
       'Overall Time in Seconds', 'Citizenship', 'Male Average Times',
       'Females Average Times', 'City', 'Country', 'Division', 'Gender',
       'Half', 'M/F', 'Name', 'Number of Records', 'Official Time', 'Overall',
       'Pace', 'State'],
      dtype='object')

##### Slicing a DataFrame

In [78]:
print (data) # printing all data for context

print (data[2:5])

     names  ages
0    Alice    31
1      Bob    24
2    James    25
3     Beth    31
4     John    29
5    Sally    29
6  Richard    33
7   Lauren    33
8  Brandon    20
9  Sabrina    21
   names  ages
2  James    25
3   Beth    31
4   John    29

### Built-In Methods <br>

<p>These are methods that are frequently used when using Pandas to make your life easier. It is possible to spend a whole week simply exploring the built-in functions supported by DataFrames in Pandas. Here however, we will simply highlight a few ones that might be useful, to give you an idea of what's possible out of the box with Pandas:</p>

##### head()

In [79]:
# DataFrame.head()  -- Accepts Integer Paramater

marathon.head(3)

,10K,15K,20K,25K,30K,35K,40K,5K,Age,Bib,Overall Time in Seconds,Citizenship,Male Average Times,Females Average Times,City,Country,Division,Gender,Half,M/F,Name,Number of Records,Official Time,Overall,Pace,State
0,12/30/1899 12:30:28 AM,12/30/1899 12:45:44 AM,12/30/1899 1:01:15 AM,12/30/1899 1:16:59 AM,12/30/1899 1:33:01 AM,12/30/1899 1:48:19 AM,12/30/1899 2:02:53 AM,12/30/1899 12:15:25 AM,24,11.0,7777,KEN,7777.0,NaN,Keringet,KEN,1,1,12/30/1899 1:04:35 AM,M,"Kirui, Geoffrey",1,12/30/1899 2:09:37 AM,1,12/30/1899 12:04:57 AM,NaN
1,12/30/1899 12:30:27 AM,12/30/1899 12:45:44 AM,12/30/1899 1:01:15 AM,12/30/1899 1:16:59 AM,12/30/1899 1:33:01 AM,12/30/1899 1:48:19 AM,12/30/1899 2:03:14 AM,12/30/1899 12:15:24 AM,30,17.0,7798,USA,7798.0,NaN,Portland,USA,2,2,12/30/1899 1:04:35 AM,M,"Rupp, Galen",1,12/30/1899 2:09:58 AM,2,12/30/1899 12:04:58 AM,OR
2,12/30/1899 12:30:29 AM,12/30/1899 12:45:44 AM,12/30/1899 1:01:16 AM,12/30/1899 1:17:00 AM,12/30/1899 1:33:01 AM,12/30/1899 1:48:31 AM,12/30/1899 2:03:38 AM,12/30/1899 12:15:25 AM,25,23.0,7828,JPN,7828.0,NaN,Machida-City,JPN,3,3,12/30/1899 1:04:36 AM,M,"Osako, Suguru",1,12/30/1899 2:10:28 AM,3,12/30/1899 12:04:59 AM,NaN

##### tail()

In [80]:
#DataFrame.tail() -- Acceptrs Integer paramter (gives acces to more rows)

marathon.tail(3)

,10K,15K,20K,25K,30K,35K,40K,5K,Age,Bib,Overall Time in Seconds,Citizenship,Male Average Times,Females Average Times,City,Country,Division,Gender,Half,M/F,Name,Number of Records,Official Time,Overall,Pace,State
26407,12/30/1899 1:43:36 AM,12/30/1899 2:32:36 AM,NaN,12/30/1899 4:15:21 AM,12/30/1899 5:06:37 AM,12/30/1899 6:00:33 AM,12/30/1899 6:54:38 AM,12/30/1899 12:53:11 AM,57,27086.0,26377,USA,NaN,26377.0,Malvern,USA,698,11973,12/30/1899 3:36:24 AM,F,"Hantel, Johanna",1,12/30/1899 7:19:37 AM,26409,12/30/1899 12:16:47 AM,PA
26408,12/30/1899 1:27:19 AM,12/30/1899 2:17:17 AM,12/30/1899 3:11:40 AM,12/30/1899 4:06:10 AM,12/30/1899 5:07:09 AM,12/30/1899 6:06:07 AM,12/30/1899 6:56:08 AM,12/30/1899 12:40:34 AM,64,25268.0,26444,USA,26444.0,NaN,New York,USA,1043,14437,12/30/1899 3:22:30 AM,M,"Reilly, Bill",1,12/30/1899 7:20:44 AM,26410,12/30/1899 12:16:49 AM,NY
26409,12/30/1899 1:17:12 AM,12/30/1899 2:00:10 AM,12/30/1899 2:58:55 AM,12/30/1899 4:27:14 AM,12/30/1899 5:37:13 AM,12/30/1899 6:39:07 AM,12/30/1899 7:41:23 AM,12/30/1899 12:39:36 AM,48,25266.0,28694,USA,28694.0,NaN,Alpharetta,USA,2553,14438,12/30/1899 3:08:16 AM,M,"Rigsby, Scott",1,12/30/1899 7:58:14 AM,26411,12/30/1899 12:18:15 AM,GA

##### shape

In [81]:
# The dataframe has a shape property, just like a NumPy matrix. 
# print(df.shape) -- DataFrame.shape -- No Paramater

marathon.shape

(26410, 26)

##### describe() <br>
<p>Probably one of the most important methods to understand...</p>

In [82]:
# Collect summary statistics in one line
#dataFrame.describe() -- Accepts parameters (all, exclude)

marathon.describe(include = 'all')

,10K,15K,20K,25K,30K,35K,40K,5K,Age,Bib,Overall Time in Seconds,Citizenship,Male Average Times,Females Average Times,City,Country,Division,Gender,Half,M/F,Name,Number of Records,Official Time,Overall,Pace,State
count,26356,26391,26377,26370,26385,26387,26404,26385,26410.000000,26364.000000,26410.000000,26410,14438.000000,11972.000000,26410,26410,26410.000000,26410.000000,26393,26410,26410,26410.0,26410,26410.000000,26410,22815
unique,2474,3596,4718,5807,6915,7998,8943,1326,NaN,NaN,NaN,98,NaN,NaN,5926,91,NaN,NaN,4920,2,26365,NaN,9269,NaN,561,68
top,12/30/1899 12:48:30 AM,12/30/1899 1:13:50 AM,12/30/1899 1:40:46 AM,12/30/1899 2:11:18 AM,12/30/1899 2:39:00 AM,12/30/1899 3:07:38 AM,12/30/1899 3:32:23 AM,12/30/1899 12:24:38 AM,NaN,NaN,NaN,USA,NaN,NaN,Boston,USA,NaN,NaN,12/30/1899 1:44:55 AM,M,"Hall, Matt",NaN,12/30/1899 3:51:18 AM,NaN,12/30/1899 12:08:43 AM,MA
freq,44,29,24,23,18,15,14,69,NaN,NaN,NaN,20175,NaN,NaN,702,20945,NaN,NaN,26,14438,2,NaN,13,NaN,157,4586
mean,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,42.587732,15795.590844,14283.555358,NaN,13734.688392,14945.478283,NaN,NaN,1588.796706,6660.973230,NaN,NaN,NaN,1.0,NaN,13206.260091,NaN,NaN
std,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,11.419467,9109.945155,2528.883183,NaN,2572.342401,2308.008629,NaN,NaN,1423.199500,3910.031525,NaN,NaN,NaN,0.0,NaN,7624.370496,NaN,NaN
min,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,18.000000,3.000000,7777.000000,NaN,7777.000000,8512.000000,NaN,NaN,1.000000,1.000000,NaN,NaN,NaN,1.0,NaN,1.000000,NaN,NaN
25%,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,34.000000,8042.750000,12499.000000,NaN,11847.000000,13321.750000,NaN,NaN,502.000000,3302.250000,NaN,NaN,NaN,1.0,NaN,6604.250000,NaN,NaN
50%,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,43.000000,16020.500000,13899.500000,NaN,13281.500000,14447.500000,NaN,NaN,1154.000000,6603.500000,NaN,NaN,NaN,1.0,NaN,13206.500000,NaN,NaN
75%,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,51.000000,23473.250000,15708.000000,NaN,15181.250000,16191.000000,NaN,NaN,2190.750000,9904.750000,NaN,NaN,NaN,1.0,NaN,19808.750000,NaN,NaN
max,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,84.000000,31437.000000,28694.000000,NaN,28694.000000,26377.000000,NaN,NaN,5846.000000,14438.000000,NaN,NaN,NaN,1.0,NaN,26411.000000,NaN,NaN

##### sort_values()

In [83]:
# Sort based on many labels, with left-to-right priority
# sorted_data = data.sort_values('ages').reset_index()
#DataFrame.sory_values('key')

sorted_data = data.sort_values('ages', kind = 'mergesort')

sorted_data_reset = data.sort_values('ages', kind = 'mergesort').reset_index(drop = True)

sorted_data_reset

     names  ages
0  Brandon    20
1  Sabrina    21
2      Bob    24
3    James    25
4     John    29
5    Sally    29
6    Alice    31
7     Beth    31
8  Richard    33
9   Lauren    33

##### .columns

In [84]:
# will show all cols headers
# DataFrame.columns 

print(marathon.columns)
print(marathon.keys())

Index(['10K', '15K', '20K', '25K', '30K', '35K', '40K', '5K', 'Age', 'Bib',
       'Overall Time in Seconds', 'Citizenship', 'Male Average Times',
       'Females Average Times', 'City', 'Country', 'Division', 'Gender',
       'Half', 'M/F', 'Name', 'Number of Records', 'Official Time', 'Overall',
       'Pace', 'State'],
      dtype='object')
Index(['10K', '15K', '20K', '25K', '30K', '35K', '40K', '5K', 'Age', 'Bib',
       'Overall Time in Seconds', 'Citizenship', 'Male Average Times',
       'Females Average Times', 'City', 'Country', 'Division', 'Gender',
       'Half', 'M/F', 'Name', 'Number of Records', 'Official Time', 'Overall',
       'Pace', 'State'],
      dtype='object')

### In-Class Exercise #2 - Describe & Sort Boston Red Sox Hitting Data <br>
<p>Take the data that you read in earlier from the Red Sox csv's and use the describe method to understand the data better. Compare the two years and decide which team is having the better year. Then sort the values based on Batting Average.</p>

In [85]:
#Use the describe method to understand the data better. 
baseballStats.describe(include = 'all')
# baseballStats.shape


#Compare the two years and decide which team is having the better year.




#describe gives us back a dataframe but you can seperate this into smaller parts



#Sort the values based on Batting Average.

answer1 = baseballStats.describe()['BA'].loc['mean']
answer2 = baseballStats2.describe()['BA'].loc['mean']

print (answer1)
print (answer2)

0.27843478260869564
0.23795000000000002

### Filtration <br>
<p>Let's look at how to filter dataframes for rows that fulfill a specific conditon.</p>

##### Conditionals

In [86]:
# Conditional boolean dataframe
data['ages']

0    31
1    24
2    25
3    31
4    29
5    29
6    33
7    33
8    20
9    21
Name: ages, dtype: int32

##### Subsetting

In [87]:
# exactly like numpy
data[data['ages'] >= 25]

     names  ages
0    Alice    31
2    James    25
3     Beth    31
4     John    29
5    Sally    29
6  Richard    33
7   Lauren    33

### Column Transformations <br>
<p>Rarely, if ever, will the columns in the original raw dataframe read from CSV or database table be the ones you actually need for your analysis. You will spend lots of time constantly transforming columns or groups of columns using general computational operations to produce new ones that are functions of the old ones. Pandas has full support for this: Consider the following dataframe containing membership term and renewal number for a group of customers:</p>

In [88]:
# Generate some fake data

customer_id = np.random.randint(1000,1100, 10)
renewal_number = np.random.randint(0,10,10)
customer_dict = {1: 0.5, 0: 1}
terms_in_years = [customer_dict[key] for key in np.random.randint(0,2,10)]

random_data = {
    'customer_id': customer_id,
    'renewal_number': renewal_number,
    'term_in_years': terms_in_years
}

customers = pd.DataFrame.from_dict(random_data)
customers

   customer_id  renewal_number  term_in_years
0         1001               8            1.0
1         1093               9            0.5
2         1070               9            0.5
3         1035               1            0.5
4         1042               9            1.0
5         1075               7            0.5
6         1065               5            0.5
7         1027               7            0.5
8         1004               1            0.5
9         1023               2            0.5

##### Generating a New Column w/Data

In [89]:
# Generate some fake data

customers['customer_tenure'] = customers['renewal_number'] * customers ['term_in_years']
customers

   customer_id  renewal_number  term_in_years  customer_tenure
0         1001               8            1.0              8.0
1         1093               9            0.5              4.5
2         1070               9            0.5              4.5
3         1035               1            0.5              0.5
4         1042               9            1.0              9.0
5         1075               7            0.5              3.5
6         1065               5            0.5              2.5
7         1027               7            0.5              3.5
8         1004               1            0.5              0.5
9         1023               2            0.5              1.0

##### User Defined Function

<p>If what you want to do to a column that can't be represented by simple mathematical operations, you can write your own $\textit{user defined function}$ with the full customizability available in Python and any external Python packages, then map it directly onto a column. Let's add some ages to our customer dataframe, and then classify them into our custom defined grouping scheme:</p>

In [90]:
# use .apply to map over dataframe

# Create a new column for ages
customers ['ages'] = np.random.randint(18,70,10)

# User Defined Function -- Make Age Groupos from our ages
def make_age_groups(age):
    if 10 <= age and 20 > age:
        return 'Teenager'
    elif 20 <= age and 35 > age:
        return 'Young Adult'
    elif 35 <= age and 65 > age:
        return 'Adult'
    elif 65 <= age:
        return 'Senior'
    
customers['age_group'] = customers['ages'].apply(make_age_groups)
customers

,customer_id,renewal_number,term_in_years,customer_tenure,ages,age_group
0,1001,8,1.0,8.0,54,Adult
1,1093,9,0.5,4.5,19,Teenager
2,1070,9,0.5,4.5,63,Adult
3,1035,1,0.5,0.5,57,Adult
4,1042,9,1.0,9.0,24,Young Adult
5,1075,7,0.5,3.5,30,Young Adult
6,1065,5,0.5,2.5,48,Adult
7,1027,7,0.5,3.5,23,Young Adult
8,1004,1,0.5,0.5,33,Young Adult
9,1023,2,0.5,1.0,69,Senior

<p>As a last example I'll show here how you would use a lambda function to create a UDF that depends on $\textit{more than one}$ column:</p>

<li>UDF = User Defined Function</li>

In [95]:
#Axis for apply can only be 1 or 0 -- 1 being the X axis 0 being the Y axis
def make_loyalty_age_group(row):
    age = row['ages']
    tenure = row ['customer_tenure']
    
    if 10 <= age and 20 > age:   
        age_group = 'Teenager'
    elif 20 <= age and 35 > age:
        age_group = 'Young Adult'
    elif 35 <= age and 65 > age:
        age_group = 'Adult'
    elif 65 <= age:
        age_group = 'Senior'
        
    if tenure > 2.0:
        
        loyalty_age_group = 'Loyal' + age_group
    else:
        loyalty_age_group = 'New' + age_group
    
    return loyalty_age_group
customers['loyalty_age_group']

KeyError: 'loyalty_age_group'

### In-Class Exercise #3 - Create Your Own UDF <br>
<p>Using the Boston Red Sox data, create your own UDF which creates a new column called 'All-Star' and puts every player with either a batting average over .280 or an on base percentage of over .360 with a result of 'Yes' in the column and 'No' if not.</p>

In [ ]:
"""
    Name  BA OBP AllStar
    --------------------
    Name .233 .360 Yes
    Name .150 .288 No
"""


def make_all_star(row):
    ba = row['BA']
    obp = row['OBP']
    
    if .280 > ba or .360 > obp:
        return 'Yes'
    else:
        return 'No'
    

baseballStats['All-Star'] = baseballStats.apply(make_all_star, axis = 1)

baseballStats[['Name','BA','OBP','All-Star']]

### Aggregations <br>
<p>The raw data plus some transformations is generally only half the story. Your objective is to extract actual insights and actionable conclusions from the data, and that means reducing it from potentially billions of rows to some summary statistics via aggregation functions.</p>

##### groupby() <br>
<p>The .groupby() function is in some ways a 'master' aggregation.</p> 

<p>Data tables will usually reserve one column as a primary key - that is, a column for which each row has a unique value. This is to facilitate access to the exact rows of a data table that a user wants to view. The other columns will often have repeated values, such as the age groups in the above examples. We can use these columns to explore the data using the Pandas API:</p>

In [92]:
# also introducing .count() here, exact same as to how it's used in SQL

# Using the groupby with the column intact as a column/key
group_all_customers = customers.groupby('age_group').count()

# display only the young adult info for customer_ids
group_all_customers.loc['Young Adult']

# display both young adult info and senior info
group_all_customers.loc[['Young Adult', 'Senior']]


# customers.groupby('age_group', as_index = False).count()[['customer_id','age_group']]


# Using the groupby with the column as an index

             customer_id  renewal_number  term_in_years  customer_tenure  ages
age_group
Young Adult            4               4              4                4     4
Senior                 1               1              1                1     1

##### Type of groupby()

<p>The result is a new dataframe, the columns of which all contain the counts of the grouped field. Notice the type of a grouped dataframe:</p>

In [93]:
print(type(customers.groupby('age_group')))
print(type(customers))

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>
<class 'pandas.core.frame.DataFrame'>

<p>This is because simply grouping data doesn't quite make sense without an aggregation function like count() to pair with. In this case, we're counting occurances of the grouped field, but that's not all we can do. We can take averages, standard deviations, mins, maxes and much more! Let's see how this works a bit more:</p>

##### mean()

In [ ]:
# mean = average
customers_groupby

##### groupby() w/Multiple Columns

<p>We end up with the average age of the groups in the last column, the average tenure in the tenure column, and so on and so forth. You can even split the groups more finely by passing a list of columns to group by:</p>

In [ ]:
customers.groupby(['age_group','ages']).mean().sort_values('ages')

##### drop_duplicates()

<p>Drops all duplicates from the current dataframe</p>

In [94]:
customers

,customer_id,renewal_number,term_in_years,customer_tenure,ages,age_group
0,1001,8,1.0,8.0,54,Adult
1,1093,9,0.5,4.5,19,Teenager
2,1070,9,0.5,4.5,63,Adult
3,1035,1,0.5,0.5,57,Adult
4,1042,9,1.0,9.0,24,Young Adult
5,1075,7,0.5,3.5,30,Young Adult
6,1065,5,0.5,2.5,48,Adult
7,1027,7,0.5,3.5,23,Young Adult
8,1004,1,0.5,0.5,33,Young Adult
9,1023,2,0.5,1.0,69,Senior

In [98]:
customers_copy = customers.drop_duplicates('renewal_number').reset_index(drop = True)
customers_copy

,customer_id,renewal_number,term_in_years,customer_tenure,ages,age_group
0,1001,8,1.0,8.0,54,Adult
1,1093,9,0.5,4.5,19,Teenager
2,1035,1,0.5,0.5,57,Adult
3,1075,7,0.5,3.5,30,Young Adult
4,1065,5,0.5,2.5,48,Adult
5,1023,2,0.5,1.0,69,Senior

<p>Thus the groupby operation allows you to rapidly make summary observations about the state of your entire dataset at flexible granularity. In one line above, we actually did something very complicated - that's the power of the dataframe. In fact, the process often consists of several iterative groupby operations, each revealing greater insight than the last - if you don't know where to start with a dataset, try a bunch of groupbys!</p>

### Homework Excersise #1 - Find the Mean for the Red Sox <br>
<p>Get total number of home runs and rbi's</p>

In [115]:
"""
TEAM    HR   RBI
----------------
BOS     144  538

"""

# step 1: Add a new column with the key 'Team' and all column values should be 'BOS'
baseballStats['Team'] = 'BOS'
baseballStats2 ['Team'] = 'BOS'

# step 2: Group by the 'Team' column and get total home runs and rbi's
hr2017 = baseballStats['HR'].sum()
rbi2017 = baseballStats['RBI'].sum()

print (f'2017 Home Runs : {hr2017}')
print (f'2017 RBI\'s : {rbi2017}\n')

hr2018 = baseballStats2['HR'].sum()
rbi2018 = baseballStats2 ['RBI'].sum()

print (f"2018 Home Runs : {hr2018}")
print (f"2018 RBI's : {rbi2018}")

data_17 = baseballStats[['Team', 'HR', 'RBI']]
data_18 = baseballStats2[['Team', 'HR', 'RBI']]


data_17 = data_17.groupby('Team').agg('sum')
data_18 = data_18.groupby('Team').agg('sum')


# Produce data for both 2017 and 2018
print(data_17)
print(data_18)

2017 Home Runs : 168
2017 RBI's : 735

2018 Home Runs : 208
2018 RBI's : 826
       HR  RBI
Team
BOS   168  735
       HR  RBI
Team
BOS   208  826

## Find the average age of runners in the 2017 Boston Marathon

In [116]:
avg_age_of_runners = marathon [['Age']].agg('mean')
print(avg_age_of_runners)

Age    42.587732
dtype: float64